{"title":"Vivo U10 (Electric Blue, 5000 mAH 18W Fast Charge Battery, 3GB RAM, 32GB Storage)","totalReview":"5 star \t\n\t 56%\n4 star \t\n\t 26%\n3 star \t\n\t 8%\n2 star \t\n\t 3%\n1 star \t\n\t 6%","count":"13,200 ratings","category":"Electronics","comments":["\tRupa\n5.0 out of 5 stars\nIndian budget just got Right!\n27 September 2019\nColour: Thunder BlackSize: 3GB+64GBStyle: PhoneVerified Purchase\nBeing a student, I had to keep every aspect in mind, Price, Value for money, performance and I am quite happy with the phone's performance. I can say, this phone is as good as 15K-20K worth phones. For quick info, I had opened 6 apps and switching back to a particular app was at ease. Let's quickly get into the pros and cons of the device.\n\nPros:-\n●Price is competitive with MI and realme\n●5000Ah battery, bigger than most of the phones in the market.\n●Screen Looks good with hd+ Resolution and is perfect for movies and videos\n●Triple camera is cherry on the cake\n●18W Fast charger in the box\n●Can Play PUBG Seamlessly\n\nCons:-\n●The front camera is not that great. But for the price, I would not ask more.\n●No earphones included.\n●Dew Drop, I am not personally a fan of it.\n\nAt the price of 9990 its a great phone. If you have 1K more as budget, you can buy the 4GB ram, as its good for better multitasking. Vivo has finally started improving specs and is doing good with their phones in the market.\nI hope my review was helpful!\nRead more\n1,240 people found this helpful\nHelpful\nComment Report abuse","\tKCR\n5.0 out of 5 stars\nAwesome mobile at this price point\n25 September 2019\nColour: Electric BlueSize: 3GB+32GBStyle: Phone\nAwesome mobile at this price point\n825 people found this helpful\nHelpful\nComment Report abuse","\tDipak Kumar\n5.0 out of 5 stars\nWhat a lovely phone..!!\n27 September 2019\nColour: Thunder BlackSize: 3GB+64GBStyle: PhoneVerified Purchase\nI simply liked it when i unboxed it and saw it at first glance. Its 16.15 cms display is quite impressive. Most of the time i watch movies while travelling to and from office . Hence I can have a better screen view now. The camera is also excellent.\n\nOverall a nice phone within a nominal budget. I’ll give it a 5 stars for now.\n535 people found this helpful\nHelpful\nComment Report abuse","\tPriyanka Kumari\n5.0 out of 5 stars\nA perfect device for average device user\n30 September 2019\nColour: Electric BlueSize: 4GB+64GBStyle: PhoneVerified Purchase\nI was looking for a budget smart phone which can perform the entire task for me. I was using MI note 6 and looking for something fresh bcz I was bored with it’s UI. I explored the content available over internet and waited for it to buy after getting the right fitment against my requirement. I am so excited to share my personal experience after my early purchase of this device. I love taking pictures of mine and surrounding too. So great camera quality is one of my main priority, after using it now I must say that it has the best camera available in this budget.\nIt’s plastic made but mirror finish back panel is the coolest thing in my blue colour device. I also appreciate the makers for understanding our further need and offering the tempered glass and transparent back cover for device protection. Once you will keep the device handy it will give you a feel of it. With the brand tag line of Vivo “Camera & Music” it really impressed me.\nI’ll surely recommend my fellow buyers to buy this cool device. But there is also something which can be improved so writing it in bullet points for your ease..\nPros:-\n● It’s really a 100% value for money device.\n● Run on latest version of Android “9”.\n● In Box soft back cover and tempered glass.\n● Dedicated kid mode for safety against unwanted operational activity of kids\n● Finger print sensor in back of the device is at perfectly placed in the reach of fingers and open the device faster.\n● 5000Ah battery, allows to watch many hours online video\n● HD+ screen Resolution and balanced colour contrast makes the viewing experience really pleasure and never hurt eyes\n● Triple camera with AI and image editing options are among the best features for me\n● Fast charging support with 18 watt inbox adaptor\n● Snapdragon 665 processor is really a power pack performer even in multitasking\nCons:-\n● Lags in PubG (However in a device with 4 GB it’s expected as the game itself take 2 GB space)\n● No headphones included\n● Front Camera struggles in low light.\n\nAt the price of 10990 its a great phone for better multitasking. Vivo has finally started improving specs and is doing good with their phones in the segment.\nI hope my review helped you in making your right decision!\nRead more\n233 people found this helpful\nHelpful\nComment Report abuse","\tmayank\n2.0 out of 5 stars\nDon't go for it\n29 September 2019\nColour: Electric BlueSize: 3GB+64GBStyle: PhoneVerified Purchase\nThe device is too heavy don't go for it. Also it lags a lot despite having a Snapdragon processor of 600 series with 3gb 64 gb storage.\n195 people found this helpful\nHelpful\nComment Report abuse","\tShreekunj Baheti\n5.0 out of 5 stars\nThe Smartphone for every citizen | Personal Use and Gifting Option | Budget Buy\n28 September 2019\nColour: Electric BlueSize: 4GB+64GBStyle: PhoneVerified Purchase\nThis phone is apt for all those who want to have a budget phone with a everything. This is a perfect for those who love to take photos, spend more time with phone(gaming, FB, YouTube, etc) and need fast Charging. Summary and detailed description below -\nCamera - ★★★★★ Fast Charging - ★★★★★ Battery- ★★★★★\nScreen - ★★★★★ UI Experience - ★★★★ Gaming-★★★★★\nAccessories - ★★★★\n\nBattery and Charging (5★)- The battery is Massive 5000mAh which Runs upto 15 hrs of continuously after charge. With a Fast charge of 18W Charger, it charges 10% in the 10 mins giving a talktime of 4 hours\nCamera (5★)- 13MP+8MP+2MP camera for all kinds of photos. Bokeh mode, Wide angle, Portrait, AI scene beautifier and It has a great inbuilt editor. The colours in the photo are Super Awesome in the camera.(pics attached)\nScreen and Gaming (5★)- The screen size if 6.35inches with more than 91% screen cover and gives a great experience while gaming and watching movies.\nProcessor and Experience (4★)- The processor is Snapdragon 655 with 4GB Ram which works smoothly while playing games ranging from PUBG to CandyCrush.\nAccessories (4★) – Comes with a Transparent Silicon-type Phone Guard(with charging point cover) and 18W Fast Charger.\nOther Features –Fingerprint scanner and Face Recognition is Superb. Front Camera is good. Normal Android Charging port and 3.5mm Jack point. Good volume, clear vocal in the microphone and a glossy finish at the back.\nCons –\nNo Earphones – Being apt for all aged people, earphones should be provided which is not there\nColour Options – More Vibrant colours are not there. Just blue and black.\n\nMy Opinion –\nA great smartphone with high performance and massive battery life. This is perfect for those who don’t wish to burn money buying expensive smart phones and just want to have a phone to do every task. This can also be great gifting option as I am gifted it to my Dad this Navratri.\nRead more\n174 people found this helpful\nHelpful\nComment Report abuse","\tSamaresh Roy\n5.0 out of 5 stars\nAssowme phone, outstanding performance\n30 September 2019\nColour: Electric BlueSize: 3GB+64GBStyle: PhoneVerified Purchase\nNice looking and very nice phone\nBattery is good and ... camera is good\n95 people found this helpful\nHelpful\nComment Report abuse","\tPramod Kumar\n1.0 out of 5 stars\nTasty & fresh\n30 September 2019\nColour: Thunder BlackSize: 4GB+64GBStyle: PhoneVerified Purchase\nDo'nt go for it i received it today, totally disappointed from camera quality provided by vivo,\nMI 7s & reamle u1 better than it.\nif u go for camera quality & display never go for it\n71 people found this helpful\nHelpful\nComment Report abuse"]}